# question

In [1]:
import pandas as pd
corpus=pd.read_csv('D:\\Python_test\\hcvdat0.csv')
corpus.head(2)

,Unnamed: 0,Category,Age,Sex,ALB,ALP,ALT,AST,BIL,CHE,CHOL,CREA,GGT,PROT
0,1,0=Blood Donor,32,m,38.5,52.5,7.7,22.1,7.5,6.93,3.23,106.0,12.1,69.0
1,2,0=Blood Donor,32,m,38.5,70.3,18.0,24.7,3.9,11.17,4.80,74.0,15.6,76.5

In [2]:
corpus.columns

Index(['Unnamed: 0', 'Category', 'Age', 'Sex', 'ALB', 'ALP', 'ALT', 'AST',
       'BIL', 'CHE', 'CHOL', 'CREA', 'GGT', 'PROT'],
      dtype='object')

In [3]:
corpus.loc[corpus.Age>36].head()

,Unnamed: 0,Category,Age,Sex,ALB,ALP,ALT,AST,BIL,CHE,CHOL,CREA,GGT,PROT
53,54,0=Blood Donor,37,m,31.4,106.0,16.6,17.0,2.4,5.95,5.30,68.0,22.9,72.3
54,55,0=Blood Donor,37,m,42.9,70.7,16.3,24.1,15.7,9.03,6.80,93.0,70.1,73.4
55,56,0=Blood Donor,37,m,44.0,57.4,26.1,24.6,9.7,10.41,6.17,83.0,38.9,76.5
56,57,0=Blood Donor,37,m,41.5,64.6,23.7,29.9,9.3,5.49,3.97,100.0,10.4,69.3
57,58,0=Blood Donor,37,m,47.9,68.8,40.3,46.9,6.0,9.76,6.42,81.0,22.7,80.6

In [4]:
corpus.loc[corpus['Age']==36].head(2)

,Unnamed: 0,Category,Age,Sex,ALB,ALP,ALT,AST,BIL,CHE,CHOL,CREA,GGT,PROT
43,44,0=Blood Donor,36,m,46.1,58.5,26.8,25.3,6.0,6.61,5.07,71.0,10.5,79.6
44,45,0=Blood Donor,36,m,45.5,57.6,22.5,19.5,7.5,5.28,4.06,88.0,62.5,71.6

In [5]:
null_corpus=corpus[corpus.isnull().any(axis=1)].values
null_corpus

array([[122, '0=Blood Donor', 43, 'm', 48.6, 45.0, 10.5, 40.5, 5.3, 7.09,
        nan, 63.0, 25.1, 70.0],
       [320, '0=Blood Donor', 32, 'f', 47.4, 52.5, 19.1, 17.1, 4.6,
        10.19, nan, 63.0, 23.0, 72.2],
       [330, '0=Blood Donor', 33, 'f', 42.4, 137.2, 14.2, 13.1, 3.4,
        8.23, nan, 48.0, 25.7, 74.4],
       [414, '0=Blood Donor', 46, 'f', 42.9, 55.1, 15.2, 29.8, 3.6, 8.37,
        nan, 61.0, 29.0, 71.9],
       [425, '0=Blood Donor', 48, 'f', 45.6, 107.2, 24.4, 39.0, 13.8,
        9.77, nan, 88.0, 38.0, 75.1],
       [434, '0=Blood Donor', 48, 'f', 46.8, 93.3, 10.0, 23.2, 4.3,
        12.41, nan, 52.0, 23.9, 72.4],
       [499, '0=Blood Donor', 57, 'f', 48.4, 94.4, 2.5, 39.6, 2.3, 8.84,
        nan, 82.0, 6.4, 76.8],
       [541, '1=Hepatitis', 38, 'm', 45.0, 56.3, nan, 33.1, 7.0, 9.58,
        6.0, 77.9, 18.9, 63.0],
       [542, '1=Hepatitis', 19, 'm', 41.0, nan, 87.0, 67.0, 12.0, 7.55,
        3.9, 62.0, 65.0, 75.0],
       [546, '1=Hepatitis', 29, 'm', 49.0, nan, 53.0, 39.0, 15.0, 8.79,
        3.6, 79.0, 37.0, 90.0],
       [547, '1=Hepatitis', 30, 'm', 45.0, nan, 66.0, 45.0, 14.0, 12.16,
        6.1, 86.0, 43.0, 77.0],
       [569, '2=Fibrosis', 49, 'm', 39.0, nan, 118.0, 62.0, 10.0, 7.28,
        3.5, 72.0, 74.0, 81.0],
       [570, '2=Fibrosis', 49, 'm', 46.0, nan, 114.0, 75.0, 16.0, 10.43,
        5.2, 72.0, 59.0, 82.0],
       [571, '2=Fibrosis', 50, 'm', 42.0, nan, 258.0, 106.0, 15.0, 8.74,
        4.7, 77.0, 80.0, 84.0],
       [572, '2=Fibrosis', 53, 'm', 46.0, nan, 34.0, 43.0, 14.0, 8.77,
        4.0, 112.0, 203.0, 76.0],
       [577, '2=Fibrosis', 71, 'm', 37.0, nan, 130.0, 90.0, 15.0, 9.92,
        4.7, 79.0, 77.0, 76.0],
       [582, '2=Fibrosis', 49, 'f', 39.0, nan, 46.0, 39.0, 9.0, 10.21,
        3.1, 89.0, 53.0, 79.0],
       [583, '2=Fibrosis', 51, 'f', 37.0, nan, 164.0, 70.0, 9.0, 3.99,
        4.2, 67.0, 43.0, 72.0],
       [584, '2=Fibrosis', 56, 'f', 39.0, nan, 42.0, 34.0, 10.0, 7.75,
        5.0, 80.0, 84.0, 78.0],
       [585, '2=Fibrosis', 75, 'f', 36.0, nan, 114.0, 125.0, 14.0, 6.65,
        nan, 57.0, 177.0, 72.0],
       [586, '3=Cirrhosis', 38, 'm', 44.0, nan, 94.0, 60.0, 12.0, 4.37,
        3.2, 61.0, 99.0, 77.0],
       [591, '3=Cirrhosis', 46, 'm', 20.0, nan, 62.0, 113.0, 254.0, 1.48,
        nan, 114.0, 138.0, nan],
       [593, '3=Cirrhosis', 47, 'm', 42.0, nan, 159.0, 102.0, 11.0, 6.29,
        5.5, 58.0, 201.0, 79.0],
       [604, '3=Cirrhosis', 65, 'm', nan, nan, 40.0, 54.0, 13.0, 7.5,
        nan, 70.0, 107.0, 79.0],
       [614, '3=Cirrhosis', 46, 'f', 33.0, nan, 39.0, 62.0, 20.0, 3.56,
        4.2, 52.0, 50.0, 71.0],
       [615, '3=Cirrhosis', 59, 'f', 36.0, nan, 100.0, 80.0, 12.0, 9.07,
        5.3, 67.0, 34.0, 68.0]], dtype=object)

In [6]:
delete_corpus=corpus.dropna().values
delete_corpus

array([[1, '0=Blood Donor', 32, ..., 106.0, 12.1, 69.0],
       [2, '0=Blood Donor', 32, ..., 74.0, 15.6, 76.5],
       [3, '0=Blood Donor', 32, ..., 86.0, 33.2, 79.3],
       ...,
       [611, '3=Cirrhosis', 62, ..., 55.7, 650.9, 68.5],
       [612, '3=Cirrhosis', 64, ..., 63.0, 35.9, 71.3],
       [613, '3=Cirrhosis', 64, ..., 66.7, 64.2, 82.0]], dtype=object)

In [7]:
exclude_data_corpus=corpus.iloc[:,4:]
print(exclude_data_corpus)

      ALB    ALP    ALT    AST   BIL    CHE  CHOL   CREA    GGT  PROT
0    38.5   52.5    7.7   22.1   7.5   6.93  3.23  106.0   12.1  69.0
1    38.5   70.3   18.0   24.7   3.9  11.17  4.80   74.0   15.6  76.5
2    46.9   74.7   36.2   52.6   6.1   8.84  5.20   86.0   33.2  79.3
3    43.2   52.0   30.6   22.6  18.9   7.33  4.74   80.0   33.8  75.7
4    39.2   74.1   32.6   24.8   9.6   9.15  4.32   76.0   29.9  68.7
..    ...    ...    ...    ...   ...    ...   ...    ...    ...   ...
610  32.0  416.6    5.9  110.3  50.0   5.57  6.30   55.7  650.9  68.5
611  24.0  102.8    2.9   44.4  20.0   1.54  3.02   63.0   35.9  71.3
612  29.0   87.3    3.5   99.0  48.0   1.66  3.63   66.7   64.2  82.0
613  33.0    NaN   39.0   62.0  20.0   3.56  4.20   52.0   50.0  71.0
614  36.0    NaN  100.0   80.0  12.0   9.07  5.30   67.0   34.0  68.0

[615 rows x 10 columns]

In [8]:
exclude_data_dropna_corpus=corpus.iloc[:,4:].dropna()
print(exclude_data_dropna_corpus)
exclude_data_dropna_corpus.drop('ALB',axis=1)

      ALB    ALP   ALT    AST   BIL    CHE  CHOL   CREA    GGT  PROT
0    38.5   52.5   7.7   22.1   7.5   6.93  3.23  106.0   12.1  69.0
1    38.5   70.3  18.0   24.7   3.9  11.17  4.80   74.0   15.6  76.5
2    46.9   74.7  36.2   52.6   6.1   8.84  5.20   86.0   33.2  79.3
3    43.2   52.0  30.6   22.6  18.9   7.33  4.74   80.0   33.8  75.7
4    39.2   74.1  32.6   24.8   9.6   9.15  4.32   76.0   29.9  68.7
..    ...    ...   ...    ...   ...    ...   ...    ...    ...   ...
608  34.0   46.4  15.0  150.0   8.0   6.26  3.98   56.0   49.7  80.6
609  39.0   51.3  19.6  285.8  40.0   5.77  4.51  136.1  101.1  70.5
610  32.0  416.6   5.9  110.3  50.0   5.57  6.30   55.7  650.9  68.5
611  24.0  102.8   2.9   44.4  20.0   1.54  3.02   63.0   35.9  71.3
612  29.0   87.3   3.5   99.0  48.0   1.66  3.63   66.7   64.2  82.0

[589 rows x 10 columns]

       ALP   ALT    AST   BIL    CHE  CHOL   CREA    GGT  PROT
0     52.5   7.7   22.1   7.5   6.93  3.23  106.0   12.1  69.0
1     70.3  18.0   24.7   3.9  11.17  4.80   74.0   15.6  76.5
2     74.7  36.2   52.6   6.1   8.84  5.20   86.0   33.2  79.3
3     52.0  30.6   22.6  18.9   7.33  4.74   80.0   33.8  75.7
4     74.1  32.6   24.8   9.6   9.15  4.32   76.0   29.9  68.7
..     ...   ...    ...   ...    ...   ...    ...    ...   ...
608   46.4  15.0  150.0   8.0   6.26  3.98   56.0   49.7  80.6
609   51.3  19.6  285.8  40.0   5.77  4.51  136.1  101.1  70.5
610  416.6   5.9  110.3  50.0   5.57  6.30   55.7  650.9  68.5
611  102.8   2.9   44.4  20.0   1.54  3.02   63.0   35.9  71.3
612   87.3   3.5   99.0  48.0   1.66  3.63   66.7   64.2  82.0

[589 rows x 9 columns]

In [9]:
exclude_data_dropna_corpus=corpus.iloc[:,4:].dropna().head()
print(exclude_data_dropna_corpus)

    ALB   ALP   ALT   AST   BIL    CHE  CHOL   CREA   GGT  PROT
0  38.5  52.5   7.7  22.1   7.5   6.93  3.23  106.0  12.1  69.0
1  38.5  70.3  18.0  24.7   3.9  11.17  4.80   74.0  15.6  76.5
2  46.9  74.7  36.2  52.6   6.1   8.84  5.20   86.0  33.2  79.3
3  43.2  52.0  30.6  22.6  18.9   7.33  4.74   80.0  33.8  75.7
4  39.2  74.1  32.6  24.8   9.6   9.15  4.32   76.0  29.9  68.7

In [10]:
exclude_data_dropna_corpus.columns

Index(['ALB', 'ALP', 'ALT', 'AST', 'BIL', 'CHE', 'CHOL', 'CREA', 'GGT',
       'PROT'],
      dtype='object')

In [11]:
corpus.columns

Index(['Unnamed: 0', 'Category', 'Age', 'Sex', 'ALB', 'ALP', 'ALT', 'AST',
       'BIL', 'CHE', 'CHOL', 'CREA', 'GGT', 'PROT'],
      dtype='object')

In [12]:
category=corpus['Category']
set(category)

{'0=Blood Donor',
 '0s=suspect Blood Donor',
 '1=Hepatitis',
 '2=Fibrosis',
 '3=Cirrhosis'}

In [13]:
final_corpus=corpus[[ 'Sex', 'ALB', 'ALP', 'ALT', 'AST',
       'BIL', 'CHE', 'CHOL', 'CREA', 'GGT', 'PROT']]
final_corpus.head()

  Sex   ALB   ALP   ALT   AST   BIL    CHE  CHOL   CREA   GGT  PROT
0   m  38.5  52.5   7.7  22.1   7.5   6.93  3.23  106.0  12.1  69.0
1   m  38.5  70.3  18.0  24.7   3.9  11.17  4.80   74.0  15.6  76.5
2   m  46.9  74.7  36.2  52.6   6.1   8.84  5.20   86.0  33.2  79.3
3   m  43.2  52.0  30.6  22.6  18.9   7.33  4.74   80.0  33.8  75.7
4   m  39.2  74.1  32.6  24.8   9.6   9.15  4.32   76.0  29.9  68.7

In [14]:
 x_data=corpus[[ 'ALB', 'ALP', 'ALT', 'AST',
       'BIL', 'CHE', 'CHOL', 'CREA', 'GGT', 'PROT']]

In [15]:
x_data.head()

    ALB   ALP   ALT   AST   BIL    CHE  CHOL   CREA   GGT  PROT
0  38.5  52.5   7.7  22.1   7.5   6.93  3.23  106.0  12.1  69.0
1  38.5  70.3  18.0  24.7   3.9  11.17  4.80   74.0  15.6  76.5
2  46.9  74.7  36.2  52.6   6.1   8.84  5.20   86.0  33.2  79.3
3  43.2  52.0  30.6  22.6  18.9   7.33  4.74   80.0  33.8  75.7
4  39.2  74.1  32.6  24.8   9.6   9.15  4.32   76.0  29.9  68.7

In [21]:
from sklearn.preprocessing import MinMaxScaler
print(x_data.columns)
x_data.head()

Index(['ALB', 'ALP', 'ALT', 'AST', 'BIL', 'CHE', 'CHOL', 'CREA', 'GGT',
       'PROT'],
      dtype='object')

    ALB   ALP   ALT   AST   BIL    CHE  CHOL   CREA   GGT  PROT
0  38.5  52.5   7.7  22.1   7.5   6.93  3.23  106.0  12.1  69.0
1  38.5  70.3  18.0  24.7   3.9  11.17  4.80   74.0  15.6  76.5
2  46.9  74.7  36.2  52.6   6.1   8.84  5.20   86.0  33.2  79.3
3  43.2  52.0  30.6  22.6  18.9   7.33  4.74   80.0  33.8  75.7
4  39.2  74.1  32.6  24.8   9.6   9.15  4.32   76.0  29.9  68.7

In [20]:
scalar=MinMaxScaler()
scalar.fit(x_data)
new_data=scalar.transform(x_data)
new_data

array([[0.35066865, 0.1016531 , 0.02096178, ..., 0.09149473, 0.01175743,
        0.53539823],
       [0.35066865, 0.14557118, 0.0527127 , ..., 0.0616189 , 0.01717203,
        0.70132743],
       [0.47548291, 0.15642734, 0.10881628, ..., 0.07282233, 0.04439975,
        0.76327434],
       ...,
       [0.20950966, 0.18751542, 0.0080148 , ..., 0.05480347, 0.09235767,
        0.82300885],
       [0.26894502,        nan, 0.1174476 , ..., 0.04107926, 0.07038985,
        0.57964602],
       [0.31352155,        nan, 0.30548705, ..., 0.05508356, 0.04563738,
        0.51327434]])

In [23]:

Frame=pd.DataFrame(new_data, columns = ['ALB', 'ALP', 'ALT', 'AST', 'BIL', 'CHE', 'CHOL', 'CREA', 'GGT','PROT'])
Frame.to_csv('D:\\Python_test\\file.csv')

In [27]:
hhh=pd.read_csv('D:\\Python_test\\file.csv')
hhh.columns

Index(['Unnamed: 0', 'ALB', 'ALP', 'ALT', 'AST', 'BIL', 'CHE', 'CHOL', 'CREA',
       'GGT', 'PROT'],
      dtype='object')